Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
1-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

  # aws_nat_gateway.this[1] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "scde-prod-us-east-1-us-east-1b"
        }
+       tags_all                           = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-us-east-1b"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

  # aws_nat_gateway.this[2] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Name" = "scde-prod-us-east-1-us-east-1c"
        }
+       tags_all                           = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-us-east-1c"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route.private_nat_gateway[1] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route.private_nat_gateway[2] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # aws_route_table.intra[0] will be created
+   resource "aws_route_table" "intra" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "scde-prod-us-east-1-intra"
        }
+       tags_all         = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-intra"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "scde-prod-us-east-1-private-us-east-1a"
        }
+       tags_all         = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-private-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "scde-prod-us-east-1-private-us-east-1b"
        }
+       tags_all         = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-private-us-east-1b"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.private[2] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "scde-prod-us-east-1-private-us-east-1c"
        }
+       tags_all         = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-private-us-east-1c"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "scde-prod-us-east-1-public"
        }
+       tags_all         = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-public"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.intra[0] will be created
+   resource "aws_route_table_association" "intra" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.intra[1] will be created
+   resource "aws_route_table_association" "intra" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.intra[2] will be created
+   resource "aws_route_table_association" "intra" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_subnet.intra[0] will be created
+   resource "aws_subnet" "intra" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.30.96.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-prod-us-east-1-intra-us-east-1a"
        }
+       tags_all                                       = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-intra-us-east-1a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.intra[1] will be created
+   resource "aws_subnet" "intra" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.30.100.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-prod-us-east-1-intra-us-east-1b"
        }
+       tags_all                                       = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-intra-us-east-1b"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.intra[2] will be created
+   resource "aws_subnet" "intra" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.30.104.0/22"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "scde-prod-us-east-1-intra-us-east-1c"
        }
+       tags_all                                       = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1-intra-us-east-1c"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.30.48.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                            = "scde-prod-us-east-1-private-us-east-1a"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/internal-elb"                 = "1"
        }
+       tags_all                                       = {
+           "Environment"                                     = "prod"
+           "Name"                                            = "scde-prod-us-east-1-private-us-east-1a"
+           "Organization"                                    = "iog"
+           "Project"                                         = "scde"
+           "Terraform"                                       = "true"
+           "Tribe"                                           = "smartcontracts"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/internal-elb"                 = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.30.64.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                            = "scde-prod-us-east-1-private-us-east-1b"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/internal-elb"                 = "1"
        }
+       tags_all                                       = {
+           "Environment"                                     = "prod"
+           "Name"                                            = "scde-prod-us-east-1-private-us-east-1b"
+           "Organization"                                    = "iog"
+           "Project"                                         = "scde"
+           "Terraform"                                       = "true"
+           "Tribe"                                           = "smartcontracts"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/internal-elb"                 = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.30.80.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                            = "scde-prod-us-east-1-private-us-east-1c"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/internal-elb"                 = "1"
        }
+       tags_all                                       = {
+           "Environment"                                     = "prod"
+           "Name"                                            = "scde-prod-us-east-1-private-us-east-1c"
+           "Organization"                                    = "iog"
+           "Project"                                         = "scde"
+           "Terraform"                                       = "true"
+           "Tribe"                                           = "smartcontracts"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/internal-elb"                 = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.30.0.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                            = "scde-prod-us-east-1-public-us-east-1a"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/elb"                          = "1"
        }
+       tags_all                                       = {
+           "Environment"                                     = "prod"
+           "Name"                                            = "scde-prod-us-east-1-public-us-east-1a"
+           "Organization"                                    = "iog"
+           "Project"                                         = "scde"
+           "Terraform"                                       = "true"
+           "Tribe"                                           = "smartcontracts"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/elb"                          = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.30.16.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                            = "scde-prod-us-east-1-public-us-east-1b"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/elb"                          = "1"
        }
+       tags_all                                       = {
+           "Environment"                                     = "prod"
+           "Name"                                            = "scde-prod-us-east-1-public-us-east-1b"
+           "Organization"                                    = "iog"
+           "Project"                                         = "scde"
+           "Terraform"                                       = "true"
+           "Tribe"                                           = "smartcontracts"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/elb"                          = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.30.32.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"                                            = "scde-prod-us-east-1-public-us-east-1c"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/elb"                          = "1"
        }
+       tags_all                                       = {
+           "Environment"                                     = "prod"
+           "Name"                                            = "scde-prod-us-east-1-public-us-east-1c"
+           "Organization"                                    = "iog"
+           "Project"                                         = "scde"
+           "Terraform"                                       = "true"
+           "Tribe"                                           = "smartcontracts"
+           "kubernetes.io/cluster/scde-prod-us-east-1-blue"  = "shared"
+           "kubernetes.io/cluster/scde-prod-us-east-1-green" = "shared"
+           "kubernetes.io/role/elb"                          = "1"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.30.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "scde-prod-us-east-1"
        }
+       tags_all                             = {
+           "Environment"  = "prod"
+           "Name"         = "scde-prod-us-east-1"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

Plan: 35 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   azs                                         = [
+       "us-east-1a",
+       "us-east-1b",
+       "us-east-1c",
    ]
+   cgw_arns                                    = []
+   cgw_ids                                     = []
+   database_nat_gateway_route_ids              = []
+   database_route_table_association_ids        = []
+   database_route_table_ids                    = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   database_subnet_arns                        = []
+   database_subnets                            = []
+   database_subnets_cidr_blocks                = []
+   database_subnets_ipv6_cidr_blocks           = []
+   default_network_acl_id                      = (known after apply)
+   default_route_table_id                      = (known after apply)
+   default_security_group_id                   = (known after apply)
+   elasticache_route_table_association_ids     = []
+   elasticache_route_table_ids                 = (known after apply)
+   elasticache_subnet_arns                     = []
+   elasticache_subnets                         = []
+   elasticache_subnets_cidr_blocks             = []
+   elasticache_subnets_ipv6_cidr_blocks        = []
+   igw_arn                                     = (known after apply)
+   igw_id                                      = (known after apply)
+   intra_route_table_association_ids           = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   intra_route_table_ids                       = [
+       (known after apply),
    ]
+   intra_subnet_arns                           = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   intra_subnets                               = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   intra_subnets_cidr_blocks                   = [
+       "10.30.96.0/22",
+       "10.30.100.0/22",
+       "10.30.104.0/22",
    ]
+   intra_subnets_ipv6_cidr_blocks              = []
+   name                                        = "scde-prod-us-east-1"
+   nat_ids                                     = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   nat_public_ips                              = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   natgw_ids                                   = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   outpost_subnet_arns                         = []
+   outpost_subnets                             = []
+   outpost_subnets_cidr_blocks                 = []
+   outpost_subnets_ipv6_cidr_blocks            = []
+   private_ipv6_egress_route_ids               = []
+   private_nat_gateway_route_ids               = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_route_table_association_ids         = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_route_table_ids                     = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_subnet_arns                         = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_subnets                             = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   private_subnets_cidr_blocks                 = [
+       "10.30.48.0/20",
+       "10.30.64.0/20",
+       "10.30.80.0/20",
    ]
+   private_subnets_ipv6_cidr_blocks            = []
+   public_internet_gateway_route_id            = (known after apply)
+   public_route_table_association_ids          = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   public_route_table_ids                      = [
+       (known after apply),
    ]
+   public_subnet_arns                          = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   public_subnets                              = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   public_subnets_cidr_blocks                  = [
+       "10.30.0.0/20",
+       "10.30.16.0/20",
+       "10.30.32.0/20",
    ]
+   public_subnets_ipv6_cidr_blocks             = []
+   redshift_public_route_table_association_ids = []
+   redshift_route_table_association_ids        = []
+   redshift_route_table_ids                    = [
+       (known after apply),
+       (known after apply),
+       (known after apply),
    ]
+   redshift_subnet_arns                        = []
+   redshift_subnets                            = []
+   redshift_subnets_cidr_blocks                = []
+   redshift_subnets_ipv6_cidr_blocks           = []
+   this_customer_gateway                       = {}
+   vpc_arn                                     = (known after apply)
+   vpc_cidr_block                              = "10.30.0.0/16"
+   vpc_enable_dns_hostnames                    = true
+   vpc_enable_dns_support                      = true
+   vpc_flow_log_cloudwatch_iam_role_arn        = ""
+   vpc_flow_log_destination_arn                = ""
+   vpc_flow_log_destination_type               = "cloud-watch-logs"
+   vpc_id                                      = (known after apply)
+   vpc_instance_tenancy                        = "default"
+   vpc_ipv6_association_id                     = (known after apply)
+   vpc_ipv6_cidr_block                         = (known after apply)
+   vpc_main_route_table_id                     = (known after apply)
+   vpc_owner_id                                = (known after apply)
+   vpc_secondary_cidr_blocks                   = []
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/us-east-1/prod/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fus-east-1%252Fprod%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/us-east-1/prod/vpc`
</details>
Plan: 35 to add, 0 to change, 0 to destroy.

---
### 39. dir: `infra/aws/us-east-2/prod/grafana/private-link` workspace: `default`
**Plan Error**
```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-2/prod/grafana/private-link": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-2/prod/grafana/private-link": 
time=2024-01-15T18:49:29Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work. prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-2/prod/grafana/vpc] 
time=2024-01-15T18:49:30Z level=error msg=/atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-2/prod/grafana/vpc/terragrunt.hcl is a dependency of /atlantis-data/repos/input-output-hk/sc-dev-platform/113/default/infra/aws/us-east-2/prod/grafana/private-link/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2024-01-15T18:49:30Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 40. dir: `infra/aws/us-east-2/prod/grafana/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-15T18:49:30Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-vpc.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 5.0.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Name" = "grafana-cloud-default"
        }
+       tags_all               = {
+           "Environment"  = "prod"
+           "Name"         = "grafana-cloud-default"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       egress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       ingress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }
    }

  # aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Name" = "grafana-cloud-default"
        }
+       tags_all               = {
+           "Environment"  = "prod"
+           "Name"         = "grafana-cloud-default"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "grafana-cloud-default"
        }
+       tags_all               = {
+           "Environment"  = "prod"
+           "Name"         = "grafana-cloud-default"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "grafana-cloud-private"
        }
+       tags_all         = {
+           "Environment"  = "prod"
+           "Name"         = "grafana-cloud-private"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.200.0.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "grafana-cloud-private-us-east-2a"
        }
+       tags_all                                       = {
+           "Environment"  = "prod"
+           "Name"         = "grafana-cloud-private-us-east-2a"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.200.16.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "grafana-cloud-private-us-east-2b"
        }
+       tags_all                                       = {
+           "Environment"  = "prod"
+           "Name"         = "grafana-cloud-private-us-east-2b"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.200.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "grafana-cloud"
        }
+       tags_all                             = {
+           "Environment"  = "prod"
+           "Name"         = "grafana-cloud"
+           "Organization" = "iog"
+           "Project"      = "scde"
+           "Terraform"    = "true"
+           "Tribe"        = "smartcontracts"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   azs                                         = [
+       "us-east-2a",
+       "us-east-2b",
    ]
+   cgw_arns                                    = []
+   cgw_ids                                     = []
+   database_nat_gateway_route_ids              = []
+   database_route_table_association_ids        = []
+   database_route_table_ids                    = [
+       (known after apply),
    ]
+   database_subnet_arns                        = []
+   database_subnets                            = []
+   database_subnets_cidr_blocks                = []
+   database_subnets_ipv6_cidr_blocks           = []
+   default_network_acl_id                      = (known after apply)
+   default_route_table_id                      = (known after apply)
+   default_security_group_id                   = (known after apply)
+   elasticache_route_table_association_ids     = []
+   elasticache_route_table_ids                 = (known after apply)
+   elasticache_subnet_arns                     = []
+   elasticache_subnets                         = []
+   elasticache_subnets_cidr_blocks             = []
+   elasticache_subnets_ipv6_cidr_blocks        = []
+   intra_route_table_association_ids           = []
+   intra_route_table_ids                       = []
+   intra_subnet_arns                           = []
+   intra_subnets                               = []
+   intra_subnets_cidr_blocks                   = []
+   intra_subnets_ipv6_cidr_blocks              = []
+   name                                        = "grafana-cloud"
+   nat_ids                                     = []
+   nat_public_ips                              = []
+   natgw_ids                                   = []
+   outpost_subnet_arns                         = []
+   outpost_subnets                             = []
+   outpost_subnets_cidr_blocks                 = []
+   outpost_subnets_ipv6_cidr_blocks            = []
+   private_ipv6_egress_route_ids               = []
+   private_nat_gateway_route_ids               = []
+   private_route_table_association_ids         = [
+       (known after apply),
+       (known after apply),
    ]
+   private_route_table_ids                     = [
+       (known after apply),
    ]
+   private_subnet_arns                         = [
+       (known after apply),
+       (known after apply),
    ]
+   private_subnets                             = [
+       (known after apply),
+       (known after apply),
    ]
+   private_subnets_cidr_blocks                 = [
+       "10.200.0.0/20",
+       "10.200.16.0/20",
    ]
+   private_subnets_ipv6_cidr_blocks            = []
+   public_route_table_association_ids          = []
+   public_route_table_ids                      = []
+   public_subnet_arns                          = []
+   public_subnets                              = []
+   public_subnets_cidr_blocks                  = []
+   public_subnets_ipv6_cidr_blocks             = []
+   redshift_public_route_table_association_ids = []
+   redshift_route_table_association_ids        = []
+   redshift_route_table_ids                    = [
+       (known after apply),
    ]
+   redshift_subnet_arns                        = []
+   redshift_subnets                            = []
+   redshift_subnets_cidr_blocks                = []
+   redshift_subnets_ipv6_cidr_blocks           = []
+   this_customer_gateway                       = {}
+   vpc_arn                                     = (known after apply)
+   vpc_cidr_block                              = "10.200.0.0/16"
+   vpc_enable_dns_hostnames                    = true
+   vpc_enable_dns_support                      = true
+   vpc_flow_log_cloudwatch_iam_role_arn        = ""
+   vpc_flow_log_destination_arn                = ""
+   vpc_flow_log_destination_type               = "cloud-watch-logs"
+   vpc_id                                      = (known after apply)
+   vpc_instance_tenancy                        = "default"
+   vpc_ipv6_association_id                     = (known after apply)
+   vpc_ipv6_cidr_block                         = (known after apply)
+   vpc_main_route_table_id                     = (known after apply)
+   vpc_owner_id                                = (known after apply)
+   vpc_secondary_cidr_blocks                   = []
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/aws/us-east-2/prod/grafana/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Faws%252Fus-east-2%252Fprod%252Fgrafana%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/aws/us-east-2/prod/grafana/vpc`
</details>
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`